### Learning Pandas
##### 1. how to find Version

In [2]:
import pandas as pd
pd.__version__
#OR
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : 9c8bc3e55188c8aff37207a74f1dd144980b8874
python                : 3.14.2
python-bits           : 64
OS                    : Windows
OS-release            : 11
Version               : 10.0.26200
machine               : AMD64
processor             : AMD64 Family 25 Model 80 Stepping 0, AuthenticAMD
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : English_United States.1252

pandas                : 2.3.3
numpy                 : 2.4.2
pytz                  : 2025.2
dateutil              : 2.9.0.post0
pip                   : 26.0.1
Cython                : None
sphinx                : None
IPython               : 9.10.0
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : None
blosc                 : None
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
html5lib              : None
hypothesis            : None
gcsfs                 : None
jinja2                : 3.1.6
lxml.etree            : None
matplotlib            : 3.10.8
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : 3.1.5
pandas_gbq            : None
psycopg2              : None
pymysql               : None
pyarrow               : 23.0.0
pyreadstat            : None
pytest                : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : 1.17.0
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
xlsxwriter            : None
zstandard             : None
tzdata                : 2025.3
qtpy                  : None
pyqt5                 : None

#### 2. To make DataFrames

In [ ]:
df = pd.DataFrame({'col A' : [1,2,3,4,5,6,7,8,],'col B' :[11,12,13,14,15,16,17,18], 'col C' :[21,22,23,24,25,26,27,28] }) 
df

   col A  col B  col C
0      1     11     21
1      2     12     22
2      3     13     23
3      4     14     24
4      5     15     25
5      6     16     26
6      7     17     27
7      8     18     28

#### 3. Using Pandas creating DataFrames from Numpy Array

In [4]:
import numpy as np
# Create a DataFrame from a NumPy array using pandas
# df = pd.DataFrame(np.random.rand(4, 8))
# print(df)
df=pd.DataFrame(np.random.rand(4, 4))
df

          0         1         2         3
0  0.105591  0.948697  0.231358  0.100644
1  0.835292  0.890516  0.101375  0.644354
2  0.827324  0.618398  0.190318  0.418715
3  0.950877  0.248284  0.013799  0.866812

##### Adding Column Names

In [5]:
df=pd.DataFrame(np.random.rand(2, 4), columns=list('abcd'))
df

          a         b         c         d
0  0.978831  0.868037  0.009445  0.624351
1  0.488902  0.992356  0.196468  0.608390

##### renaming Column Names

In [6]:
df.rename(columns={'a':'A',  'b': 'B', 'c' : 'C', 'd' : 'D' }, inplace=True)
df

          A         B         C         D
0  0.978831  0.868037  0.009445  0.624351
1  0.488902  0.992356  0.196468  0.608390

In [7]:
#Same for DataFrames Created Through Pandas 
df=pd.DataFrame({'col A' : [1,2,3,4,5,6,7,8,],'col B' :[11,12,13,14,15,16,17,18] }) 
df.rename(columns={'col A' : 'Y','col B' : 'Z' }, inplace=True)  
df

   Y   Z
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15
5  6  16
6  7  17
7  8  18

In [8]:
#OR easy renaming
df.columns=['Col__01', 'Col__02']
df

   Col__01  Col__02
0        1       11
1        2       12
2        3       13
3        4       14
4        5       15
5        6       16
6        7       17
7        8       18

In [9]:
#to replace character or string
df.columns=df.columns.str.replace('__', ' ')
df

   Col 01  Col 02
0       1      11
1       2      12
2       3      13
3       4      14
4       5      15
5       6      16
6       7      17
7       8      18

##### Adding Prefix & Suffix

In [10]:

# Adding suffix to columns
df = df.add_suffix('_end')
df

   Col 01_end  Col 02_end
0           1          11
1           2          12
2           3          13
3           4          14
4           5          15
5           6          16
6           7          17
7           8          18

In [11]:
# Adding prefix to columns 
df = df.add_prefix('Start_')
df

   Start_Col 01_end  Start_Col 02_end
0                 1                11
1                 2                12
2                 3                13
3                 4                14
4                 5                15
5                 6                16
6                 7                17
7                 8                18